# Import the dataset from this
(https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [107]:
import pandas as pd

In [108]:
dataset = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user')

In [109]:
dataset

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

# Import the dataset from this
(https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).
Use sep= "|" while reading the data

In [110]:
dataset = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep = '|')

In [111]:
dataset

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

# Assign it to a variable called users and use the 'user_id' as index

In [112]:
dataset = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep = '|',index_col= 'user_id')

In [113]:
print(dataset.head())

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

# See the first 10 and last 10 entries

In [114]:
print("First 10 Rows".center(80,'-'))
print(dataset.head(10))
print("Last 10 Rows".center(80,'-'))
print(dataset.tail(10))

---------------------------------First 10 Rows----------------------------------
         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
----------------------------------Last 10 Rows----------------------------------
         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# What is the number of observations in the dataset?

In [115]:
# observations of dataset
print("Number of Observations :",dataset.shape[0])

Number of Observations : 943

# What is the number of columns in the dataset?

In [116]:
# number of columns
print("Number of Columns :",dataset.shape[1])

Number of Columns : 4

# Print the name of all the columns.

In [117]:
# names of all columns
dataset.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# How is the dataset indexed?

In [118]:
print(dataset.index)

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

# What is the data type of each column?

In [119]:
print(dataset.dtypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# Print only the occupation column

In [120]:
dataset['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# How many different occupations are in this dataset?

In [121]:
dataset['occupation'].value_counts().count()

21

# What is the most frequent occupation?

In [122]:
dataset['occupation'].mode()

0    student
Name: occupation, dtype: object

# DataFrame Info.

In [123]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

# Describe all the columns

In [124]:
df.describe(include ='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

# Summarize only the occupation column

In [125]:
dataset['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# What is the mean age of users?

In [126]:
dataset.age.mean()

34.05196182396607

# What is the age with least occurrence?

In [136]:
dataset.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64